# Save to CSV

### Include

In [1]:
from pathlib import *
import pandas as pd
from sqlalchemy.engine import URL
from sqlalchemy import create_engine
import psycopg2

### Initialize

In [2]:
# data folder
data_folder = 'Resources'
data_file = data_folder + '/DestinationFlightTimes.csv'

#db connection
engine = create_engine(f'postgresql://postgres:password@localhost/FlightDB')

### Load

In [3]:
#prepare sql
sql_text = '''
SELECT
    locationfromid flyfrom, 
    locationtoid flyto, 
    stopid,
    CAST(avg(timetaken) as int) flymins
FROM 
        public.flight fl
GROUP BY
        locationfromid, 
        locationtoid, 
        stopid
ORDER BY
    1, 2, 3;        
'''

In [4]:
sql_query = pd.read_sql_query (sql_text, engine)

In [5]:
DF = pd.DataFrame(sql_query)

In [6]:
engine.dispose()

### Save

In [7]:
DF.to_csv(data_file, index=False)

In [8]:
DF.head()

   flyfrom  flyto  stopid  flymins
0        1      2       1      926
1        1      2       2     1112
2        1      2       3       63
3        1      3       1      665
4        1      3       2      601